mongo.org

#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Mongo Documentation
#+DATE: <2019-06-13 Thurs>
#+AUTHOR: Mercia Malan
#+EMAIL: malan747@gmail.com
#+TOC: nil
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 27.0.50 (Org mode 9.1.9)
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_HEAD: <link rel="stylesheet" href="./bootstrap.css" />
#+HTML_HEAD: <style type="text/css"> body { width: 70em; margin: 50px 100px; } </style>
#+CREATOR: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="https://orgmode.org">Org</a> mode 9.1.9)

* M201

** Hardware:
Database designed around the usage of memory
- aggregation, index traversing, write operations, query engine, connections(1mb per established connection)

By default mongo will try to use all cpu cores.

Page compression, data calculation, aggregation, map reduce requires cpu cores

Writing constantly to the same document - each document will block writes on that document, thus multiple writes to the same document won't be increased by concurrency

*** Persisting data
- higher IOPS your server provides, the faster your writes and reads will be

Mongo will benefit from some, but not all raid architectures - such as 10. Discourage using raid 5 or 6 or 0. Raid 10 provides redundancy across drives and also optimised for read and write

Mongo can use multiple disks

*** Network hardware
Faster and larger bandwidth, the faster. Firewalls, load balances etc also play a role in network latency.
Make sure write & read concern and read preference aligns with network architecure

** Indexes:
   index keeps a reference to the document
   Also uses b-tree for storing index
   e.g.: lastname: 1

   acosta --> {lastname: acosta ...}
   bailey --> {lastname: bailey ...}

   writes, updates and deletes slows down the more indexes there are, thus try to not have many irrelevant indexes. Each write might need to rebalance b-tree

*** How is data stored on disk
**** WiredTiger
     Creates a file for each collection and each index
     Can run mongod with --directoryperdb and then it will create a sub directory per db
     Can run with --WiredTigerDirectoryForIndexes and inside each db sub directory it will create a "collections" and an "index" folders. This is useful if you want to create symbolic links to different disks.

*** Single Field Index
    Can specify index with dot notation for sub documents. It's bad practice to create an index on a subdocument field - rather create it on the nested field inside the sub document by using dot notation

*** Sorting and indexes
    When running a query with a sort on the field that is indexed, it will do an IXSCAN (index scan), because it uses the index keys to help with sorting. IXSCAN can either be forward or backward depending on the sorting direction vs the index. e.g. if the index is ascending ({name: 1}) and sort is ascending (.sort({name:1}), forward ixscan would be used. if it was .sort({name: -1}), it would use a backward ixscan.

*** Compound Indexes
    For compound indexes it is still stored flat. e.g. on lastname and firstname, it will have index keys such as ("last","first") (such as in a telephone book).
    Compound indexes has index prefixes, which will be the first key, the first and second keys, the first, second and third keys etc.
    E.g.: {last_name: 1, first_name: 1, age:1}
    Prefixes: {last_name: 1}, {last_name: 1, first_name: 1}
    Prefixes can also be scanned forward and backward, as long as the direction is either exactly what it is in the index, or the exact opposite

*** Multi-key Indexes
    When your index key is inside an array, it will create a key per value in the array. Can only create one multi-key indexes. (ie only one index that is in an array}
    Multi-key indexes do not support covered queries
    E.g.
    #+BEGIN_SRC javascript
    {
      productName: ["x","y","z"],
      stock: [
          {name: "a", qty: 1},
          {name: "b", qty: 2},
          {name: "c", qty: 2},
      ]
    }
    #+END_SRC
    Can have an index on productName or on stock.qty, but not on both. Index on productName will create 3 index keys: x,y,z. 
    
*** Partial Indexes
    Create an index on only a subsection of the data, for example:
    #+BEGIN_SRC javascript
      {
          "name" : "some restaurant",
          "cuisine" : "Indian",
          "stars" : 4.4,
          "address": {
              "street": "123 str",
              "city": "New York"
          }
      }

      db.restaurants.createIndex(
          { "address.city": 1, "cuisine": 1 },
          { partialFilterExpression: { 'stars': { $gte: 3.5 } } }
      )
    #+END_SRC
    
*** Text Indexes
    #+BEGIN_SRC javascript
      {
          productName: "MongoDB long sleeve t-shirt",
          category: "Clothing"
      }

      db.restaurants.createIndex(
          {productName: "text" }
      )

      //leverages mongo's full text search capabilities:
      db.products.find({ $text: {$search: "t-shirt" }})
    #+END_SRC
    
    Will create 5 indexes: mongodb, long, sleeve, t, shirt.
    Take note that this type of index will take a lot longer to write. One way to make this a bit better is to use compound indexes, like including category as first index key.
    Text queries logically or, so searching for like $search: "mongodb long" will do "mongodb" or "long". You can project a text score and then sort by it, which will sort according to how well it searched

    #+BEGIN_SRC javascript
      db.products.find(
          { $text: { $search: "MongoDB long" } },
          { $meta: "textScore" }
      ).sort( {
          score: {$meta: "textScore" }
      })
    #+END_SRC

*** Collations
    Settings for specific locale's. Can specify different collation's for indexes
    #+BEGIN_SRC javascript
      db.foreign_text.createIndex(
          {name: 1},
          {collation: {locale: 'it'}}
      )
      //to use, the query must match the collation
      db.foreign_text.find({name: "x"}).collation({locale: 'it'})
    #+END_SRC
   
    Can add strength: 1 to the collation to ignore case

*** Building Indexes
   Foreground indexes will block the entire databases until build is complete.
   Background indexes don't block operations, but take a lot longer and will still impact queries. (to indicate background, add extra document to createIndex {"backround":true})

**** Query Plans
    Plan created when a query is run. Multiple will be created and best one is then chosen when running the plan
    Starts by looking at the indexes to see which one(s) can be used, and then tries each of them and compares.
    Plans are cached and cache cleared when: restart, threshold of factor of 10, index rebuilt or if index is created or dropped

**** explain()
     Create explainable object e.g. exp = db.people.explain(), and then do exp.find()
     default is 'queryPlanner' (doesn't execute query), 'executionStats' and 'allPlansExecution' (both executes query)
     Can store the explain output to a variable and access certain parts directly
     
     
     #+BEGIN_SRC javascript
       var exp = db.people.find({}).explain()

       exp.executionStats.executionStages
     #+END_SRC
     
     With shards, different shards might return different winningplans

*** Force Index
   Add .hint({..index..}) to force it to use index - use with caution
   
*** Resource allocation for indexes
   RAM will be the biggest used resource for indexes

