mongo.tex
% Created 2020-01-21 Tue 18:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mercia Malan}
\date{\textit{<2019-06-13 Thu>}}
\title{Mongo Documentation}
\hypersetup{
 pdfauthor={Mercia Malan},
 pdftitle={Mongo Documentation},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{M201}
\label{sec:org3045f35}

\subsection{Hardware:}
\label{sec:org3799755}
Database designed around the usage of memory
\begin{itemize}
\item aggregation, index traversing, write operations, query engine, connections(1mb per established connection)
\end{itemize}

By default mongo will try to use all cpu cores.

Page compression, data calculation, aggregation, map reduce requires cpu cores

Writing constantly to the same document - each document will block writes on that document, thus multiple writes to the same document won't be increased by concurrency

\subsubsection{Persisting data}
\label{sec:org774fb98}
\begin{itemize}
\item higher IOPS your server provides, the faster your writes and reads will be
\end{itemize}

Mongo will benefit from some, but not all raid architectures - such as 10. Discourage using raid 5 or 6 or 0. Raid 10 provides redundancy across drives and also optimised for read and write

Mongo can use multiple disks

\subsubsection{Network hardware}
\label{sec:org84b520e}
Faster and larger bandwidth, the faster. Firewalls, load balances etc also play a role in network latency.
Make sure write \& read concern and read preference aligns with network architecure

\subsection{Indexes:}
\label{sec:org2a7a9f4}
index keeps a reference to the document
Also uses b-tree for storing index
e.g.: lastname: 1

acosta --> \{lastname: acosta \ldots{}\}
bailey --> \{lastname: bailey \ldots{}\}

writes, updates and deletes slows down the more indexes there are, thus try to not have many irrelevant indexes. Each write might need to rebalance b-tree

\subsubsection{How is data stored on disk}
\label{sec:org99952be}
\begin{enumerate}
\item WiredTiger
\label{sec:orgf6eb9a6}
Creates a file for each collection and each index
Can run mongod with --directoryperdb and then it will create a sub directory per db
Can run with --WiredTigerDirectoryForIndexes and inside each db sub directory it will create a "collections" and an "index" folders. This is useful if you want to create symbolic links to different disks.
\end{enumerate}

\subsubsection{Single Field Index}
\label{sec:orgfcdbbef}
Can specify index with dot notation for sub documents. It's bad practice to create an index on a subdocument field - rather create it on the nested field inside the sub document by using dot notation

\subsubsection{Sorting and indexes}
\label{sec:org6b046b7}
When running a query with a sort on the field that is indexed, it will do an IXSCAN (index scan), because it uses the index keys to help with sorting. IXSCAN can either be forward or backward depending on the sorting direction vs the index. e.g. if the index is ascending (\{name: 1\}) and sort is ascending (.sort(\{name:1\}), forward ixscan would be used. if it was .sort(\{name: -1\}), it would use a backward ixscan.

\subsubsection{Compound Indexes}
\label{sec:org44729e3}
For compound indexes it is still stored flat. e.g. on lastname and firstname, it will have index keys such as ("last","first") (such as in a telephone book).
Compound indexes has index prefixes, which will be the first key, the first and second keys, the first, second and third keys etc.
E.g.: \{last\(_{\text{name}}\): 1, first\(_{\text{name}}\): 1, age:1\}
Prefixes: \{last\(_{\text{name}}\): 1\}, \{last\(_{\text{name}}\): 1, first\(_{\text{name}}\): 1\}
Prefixes can also be scanned forward and backward, as long as the direction is either exactly what it is in the index, or the exact opposite

\subsubsection{Multi-key Indexes}
\label{sec:org5df66ae}
When your index key is inside an array, it will create a key per value in the array. Can only create one multi-key indexes. (ie only one index that is in an array\}
Multi-key indexes do not support covered queries
E.g.
\begin{verbatim}
{
  productName: ["x","y","z"],
  stock: [
      {name: "a", qty: 1},
      {name: "b", qty: 2},
      {name: "c", qty: 2},
  ]
}
\end{verbatim}
Can have an index on productName or on stock.qty, but not on both. Index on productName will create 3 index keys: x,y,z. 

\subsubsection{Partial Indexes}
\label{sec:org5d43042}
Create an index on only a subsection of the data, for example:
\begin{verbatim}
{
    "name" : "some restaurant",
    "cuisine" : "Indian",
    "stars" : 4.4,
    "address": {
        "street": "123 str",
        "city": "New York"
    }
}

db.restaurants.createIndex(
    { "address.city": 1, "cuisine": 1 },
    { partialFilterExpression: { 'stars': { $gte: 3.5 } } }
)
\end{verbatim}

\subsubsection{Text Indexes}
\label{sec:org5457ce7}
\begin{verbatim}
{
    productName: "MongoDB long sleeve t-shirt",
    category: "Clothing"
}

db.restaurants.createIndex(
    {productName: "text" }
)

//leverages mongo's full text search capabilities:
db.products.find({ $text: {$search: "t-shirt" }})
\end{verbatim}

Will create 5 indexes: mongodb, long, sleeve, t, shirt.
Take note that this type of index will take a lot longer to write. One way to make this a bit better is to use compound indexes, like including category as first index key.
Text queries logically or, so searching for like \$search: "mongodb long" will do "mongodb" or "long". You can project a text score and then sort by it, which will sort according to how well it searched

\begin{verbatim}
db.products.find(
    { $text: { $search: "MongoDB long" } },
    { $meta: "textScore" }
).sort( {
    score: {$meta: "textScore" }
})
\end{verbatim}

\subsubsection{Collations}
\label{sec:org47dd081}
Settings for specific locale's. Can specify different collation's for indexes
\begin{verbatim}
db.foreign_text.createIndex(
    {name: 1},
    {collation: {locale: 'it'}}
)
//to use, the query must match the collation
db.foreign_text.find({name: "x"}).collation({locale: 'it'})
\end{verbatim}

Can add strength: 1 to the collation to ignore case

\subsubsection{Building Indexes}
\label{sec:orgd769104}
Foreground indexes will block the entire databases until build is complete.
Background indexes don't block operations, but take a lot longer and will still impact queries. (to indicate background, add extra document to createIndex \{"backround":true\})

\begin{enumerate}
\item Query Plans
\label{sec:orge6a2ba6}
Plan created when a query is run. Multiple will be created and best one is then chosen when running the plan
Starts by looking at the indexes to see which one(s) can be used, and then tries each of them and compares.
Plans are cached and cache cleared when: restart, threshold of factor of 10, index rebuilt or if index is created or dropped

\item explain()
\label{sec:org7ee7093}
Create explainable object e.g. exp = db.people.explain(), and then do exp.find()
default is 'queryPlanner' (doesn't execute query), 'executionStats' and 'allPlansExecution' (both executes query)
Can store the explain output to a variable and access certain parts directly


\begin{verbatim}
var exp = db.people.find({}).explain()

exp.executionStats.executionStages
\end{verbatim}

With shards, different shards might return different winningplans
\end{enumerate}

\subsubsection{Force Index}
\label{sec:org61f86a7}
Add .hint(\{..index..\}) to force it to use index - use with caution

\subsubsection{Resource allocation for indexes}
\label{sec:org7c0d5b4}
RAM will be the biggest used resource for indexes
