mongo.org
*** How to determine index size
    Mongo compass, or db.stats()
    If there is no disk space left for indexes, they won't be created

*** How to determine how much memory indexes uses 
    db.col.stats({indexDetails: true})
    It's quite a lot of data so rather assign it to a variable and then access certain parts, such as "indexDetails"
     #+BEGIN_SRC javascript
       stats = db.col.stats({indexDetails: true})
       stats.indexDetails
       //look at further details per index e.g.
       stats.indexDetails.index_name.cache //contains total bytes currently in cache
     #+END_SRC

*** Edge cases of indexes
*** Occasional reports and needing indexes to support them
    Indexes that are not being used should not exist. Indexes needed occasionally should not be in memory.
    Can create indexes only on a secondary to be used specifically for a report

*** right-end-side index increments
    As we're inserting data, the index B-tree might always grow on the right-hand side and thus unbalanced.
    We can then only check the right side of the index memory to know how much memory to allocate for a specific query. E.g. if you know you're only querying recently added data, it will only use the latest indexes, and thus do not need the entire index in memory.
 
** Optimising CRUD queries

*** Index Selection
    Equality queries are better for use with indexes because it's very specific, whereas range queries are not specific
    So selection is better with equality. Consider this in index order - keep equalities first
    E.g.
    #+BEGIN_SRC javascript
      db.col.find({"zipcode": 1000}) //equality
      db.col.find({"zipcode": {$gt: 5000}}) //range query
    #+END_SRC
    

*** Equality, Sort, Range
    Query and index for most performance e.g.:
    #+BEGIN_SRC javascript
      db.restaurants.find({'address.zipcode': {$gt: '5000'}, cuisine: 'Sushi' })
          .sort({stars: -1})

      db.restaurants.createIndex({ "cuisine": 1, "stars": 1, "address.zipcode": 1})
    #+END_SRC
    
    Indexes should always be done in this order, first list equality, then sort, then range.


*** Performance Tradeoffs
    Sometimes it makes sense to be a little bit less selective to prevent an in memory sort, because execution time will be less.
    In the example above, stars and zipcode was switched, because having the stars last makes it do an in memory sort.
    In the current order it will examine more keys, but only do an index scan followed by a fetch, which has a much lower execution time than before.

*** Covered Queries
    The entire query is serviced by index keys. 0 documents to be examined
    One way to do this is by adding a projection which only contains the index keys, this way mongo can run the query and return values by only using index. (note _id: 0). 
    
    Covered queries only work if all the fields are in the query and in the projection. Using the opposite projection by ommitting fields, even if the rest that are left over are all in the index,
    it will not be covered - how is mongo to know for sure that ALL documents only have the index fields left.

    You can't cover a query if
    - Any of the index fields are arrays
    - Any of the index fields are embedded documents
    - When run against a mongos if the index does not contain the shard key
      
*** Regex Performance
    Regex is not very performant in general.
    
    #+BEGIN_SRC javascript
      db.users.find({username: /kirby/})
      //if there is an index on username it will be a bit faster, however for the regex it will still
      //have to check every index key

      //to make it better, by specifying ^ to say "begins with kirby":
      db.users.find({username: /^kirby/})

    #+END_SRC
    
*** Insert Performance
**** Write concern
     w: how many members of replica set we're waiting for to acknowledge write, a number or 'majority'
     j: journal - should we wait for the on-disk journal to be written
     wtimeout: how long (in ms) we want to wait for the write acknowledgement before timing out
    
   Indexes affect write time, as it needs to write to the B-tree as well.

   To set writeConcern in Java:
   #+BEGIN_SRC java
     MongoClient mongoClient = new MongoClient();

     db = mongoClient.getDatabase("test");
     coll = db.getCollection("coll");

     WriteConcern w = new WriteConcern();

     //withW: number, 1 = primary only, 2 = primary and 1 secondary etc, or "majority"
     //withJournal: true / false
     w = w.withW(1).withJournal(false);

     coll = coll.withWriteConcern(w);

   #+END_SRC
   
**** Index Overhead
     Test run on the dude's imac, so just a general idea, not 100% accurate for prod clusters

   |          Number of indexes |    0    |   1    |   5    |
   |----------------------------+---------+--------+--------|
   |        Average inserts/sec | ~ 16000 | ~15000 | ~10500 |
   |----------------------------+---------+--------+--------|
   | Percent loss from baseline |   0%    |  ~6.3% | ~34.4% |
   |----------------------------+---------+--------+--------|
   
   
   Write Concern:
   
   | Write Concern              | { w: 1,   | {        | {               | {               |
   |                            | j: false, |  w: 1,   |  w: "majority", |  w: "majority", |
   |                            | }         |  j: true |  j: false       |  j: true        |
   |                            |           | }        | }               | }               |
   |----------------------------+-----------+----------+-----------------+-----------------|
   | Average inserts/sec        | ~ 27000   |  ~19000  |      ~16000     |     ~14000      |
   |----------------------------+-----------+----------+-----------------+-----------------|
   | Percent loss from baseline |    0%     |  ~29.6%  |      ~40.7%     |      48.1%      |
   |----------------------------+-----------+----------+-----------------+-----------------|
   

*** Data Type Implications
    Query matching:
    Need to specify the type if using something specific e.g. NumberDecimal - 2.34 and NumberDecimal(2.34) are not the same thing
    
    For sorting, when one field has different values, bson types are sorted as follows:
    1. MinKey (internal type)
    2. Null
    3. Numbers (ints, longs, doubles, decimals
    4. Symbol, String
    5. Object
    6. Array
    7. BinData
    8. ObjectId
    9. Boolean
    10. Date
    11. Timestamp
    12. Regular Expression
    13. MaxKey (internal type)
        
    Same grouping will happen on an index. The B-tree will actually group it by the above data types
    
*** Aggregation performance
**** Index Usage
     Some pipeline stages uses indexes, and some don't. If a stage is not using an index, none of the stages after it will use indexes
     
     #+BEGIN_SRC javascript
       db.coll.aggregate([
           { ... }
       ], {explain: true})
     #+END_SRC
***** Match 
     Can use an index, especially if it is early in the pipeline.
***** Sort
     Keep it early in the pipeline as well for index usage to avoid in memory sorting.
***** limit
      Keep it close to the match and sort (e.g. match, limit, sort), because then it can use a top-k sorting algorithm

**** Memory Constraints
     Documents has 16 MB limit
     For this reason, use $limit and $project
     100MB RAM per stage limit (can use allowDiskUse: true - last resort!)
      -- allowDiskUsage does not work with GraphLookup
      
** Performance of distributed systems 
   In sharding - define what is a good shard key by knowing how data is accessed. 
   
   Because a sharded cluster contains MongoS + config servers + shard nodes latency does have an effect. Having the mongos on the same server as the client application an help.
   
*** Reads on Sharded Clusters
   Two types of reads in sharded clusters, depending on whether we're using the shard key in our queries or not
   1. Scatter Gather - ask every shard node
   2. Router queries - ask a specific node
      
