mongo.tex

\subsubsection{How to determine index size}
\label{sec:org93405a8}
Mongo compass, or db.stats()
If there is no disk space left for indexes, they won't be created

\subsubsection{How to determine how much memory indexes uses}
\label{sec:orgc0300f4}
db.col.stats(\{indexDetails: true\})
It's quite a lot of data so rather assign it to a variable and then access certain parts, such as "indexDetails"
\begin{verbatim}
stats = db.col.stats({indexDetails: true})
stats.indexDetails
//look at further details per index e.g.
stats.indexDetails.index_name.cache //contains total bytes currently in cache
\end{verbatim}

\subsubsection{Edge cases of indexes}
\label{sec:orgb732113}
\subsubsection{Occasional reports and needing indexes to support them}
\label{sec:org2aff24a}
Indexes that are not being used should not exist. Indexes needed occasionally should not be in memory.
Can create indexes only on a secondary to be used specifically for a report

\subsubsection{right-end-side index increments}
\label{sec:org3743f2c}
As we're inserting data, the index B-tree might always grow on the right-hand side and thus unbalanced.
We can then only check the right side of the index memory to know how much memory to allocate for a specific query. E.g. if you know you're only querying recently added data, it will only use the latest indexes, and thus do not need the entire index in memory.

\subsection{Optimising CRUD queries}
\label{sec:orgdab4444}

\subsubsection{Index Selection}
\label{sec:orgc02fae6}
Equality queries are better for use with indexes because it's very specific, whereas range queries are not specific
So selection is better with equality. Consider this in index order - keep equalities first
E.g.
\begin{verbatim}
db.col.find({"zipcode": 1000}) //equality
db.col.find({"zipcode": {$gt: 5000}}) //range query
\end{verbatim}


\subsubsection{Equality, Sort, Range}
\label{sec:orgede5241}
Query and index for most performance e.g.:
\begin{verbatim}
db.restaurants.find({'address.zipcode': {$gt: '5000'}, cuisine: 'Sushi' })
    .sort({stars: -1})

db.restaurants.createIndex({ "cuisine": 1, "stars": 1, "address.zipcode": 1})
\end{verbatim}

Indexes should always be done in this order, first list equality, then sort, then range.


\subsubsection{Performance Tradeoffs}
\label{sec:org9bd6cbc}
Sometimes it makes sense to be a little bit less selective to prevent an in memory sort, because execution time will be less.
In the example above, stars and zipcode was switched, because having the stars last makes it do an in memory sort.
In the current order it will examine more keys, but only do an index scan followed by a fetch, which has a much lower execution time than before.

\subsubsection{Covered Queries}
\label{sec:org54d85df}
The entire query is serviced by index keys. 0 documents to be examined
One way to do this is by adding a projection which only contains the index keys, this way mongo can run the query and return values by only using index. (note \_id: 0). 

Covered queries only work if all the fields are in the query and in the projection. Using the opposite projection by ommitting fields, even if the rest that are left over are all in the index,
it will not be covered - how is mongo to know for sure that ALL documents only have the index fields left.

You can't cover a query if
\begin{itemize}
\item Any of the index fields are arrays
\item Any of the index fields are embedded documents
\item When run against a mongos if the index does not contain the shard key
\end{itemize}

\subsubsection{Regex Performance}
\label{sec:orgd55db12}
Regex is not very performant in general.

\begin{verbatim}
db.users.find({username: /kirby/})
//if there is an index on username it will be a bit faster, however for the regex it will still
//have to check every index key

//to make it better, by specifying ^ to say "begins with kirby":
db.users.find({username: /^kirby/})

\end{verbatim}

\subsubsection{Insert Performance}
\label{sec:orgc690189}
\begin{enumerate}
\item Write concern
\label{sec:org0e13963}
w: how many members of replica set we're waiting for to acknowledge write, a number or 'majority'
j: journal - should we wait for the on-disk journal to be written
wtimeout: how long (in ms) we want to wait for the write acknowledgement before timing out

Indexes affect write time, as it needs to write to the B-tree as well.

To set writeConcern in Java:
\begin{verbatim}
MongoClient mongoClient = new MongoClient();

db = mongoClient.getDatabase("test");
coll = db.getCollection("coll");

WriteConcern w = new WriteConcern();

//withW: number, 1 = primary only, 2 = primary and 1 secondary etc, or "majority"
//withJournal: true / false
w = w.withW(1).withJournal(false);

coll = coll.withWriteConcern(w);

\end{verbatim}

\item Index Overhead
\label{sec:org587059f}
Test run on the dude's imac, so just a general idea, not 100\% accurate for prod clusters

\begin{center}
\begin{tabular}{llll}
Number of indexes & 0 & 1 & 5\\
\hline
Average inserts/sec & \textasciitilde{} 16000 & \textasciitilde{}15000 & \textasciitilde{}10500\\
\hline
Percent loss from baseline & 0\% & \textasciitilde{}6.3\% & \textasciitilde{}34.4\%\\
\hline
\end{tabular}
\end{center}


Write Concern:

\begin{center}
\begin{tabular}{lllll}
Write Concern & \{ w: 1, & \{ & \{ & \{\\
 & j: false, & w: 1, & w: "majority", & w: "majority",\\
 & \} & j: true & j: false & j: true\\
 &  & \} & \} & \}\\
\hline
Average inserts/sec & \textasciitilde{} 27000 & \textasciitilde{}19000 & \textasciitilde{}16000 & \textasciitilde{}14000\\
\hline
Percent loss from baseline & 0\% & \textasciitilde{}29.6\% & \textasciitilde{}40.7\% & 48.1\%\\
\hline
\end{tabular}
\end{center}
\end{enumerate}


\subsubsection{Data Type Implications}
\label{sec:orgb63e555}
Query matching:
Need to specify the type if using something specific e.g. NumberDecimal - 2.34 and NumberDecimal(2.34) are not the same thing

For sorting, when one field has different values, bson types are sorted as follows:
\begin{enumerate}
\item MinKey (internal type)
\item Null
\item Numbers (ints, longs, doubles, decimals
\item Symbol, String
\item Object
\item Array
\item BinData
\item ObjectId
\item Boolean
\item Date
\item Timestamp
\item Regular Expression
\item MaxKey (internal type)
\end{enumerate}

Same grouping will happen on an index. The B-tree will actually group it by the above data types

\subsubsection{Aggregation performance}
\label{sec:org9066cc5}
\begin{enumerate}
\item Index Usage
\label{sec:org1d00f42}
Some pipeline stages uses indexes, and some don't. If a stage is not using an index, none of the stages after it will use indexes

\begin{verbatim}
db.coll.aggregate([
    { ... }
], {explain: true})
\end{verbatim}
\begin{enumerate}
\item Match
\label{sec:org0236abf}
Can use an index, especially if it is early in the pipeline.
\item Sort
\label{sec:org7e13c5f}
Keep it early in the pipeline as well for index usage to avoid in memory sorting.
\item limit
\label{sec:org7a28ee6}
Keep it close to the match and sort (e.g. match, limit, sort), because then it can use a top-k sorting algorithm
\end{enumerate}

\item Memory Constraints
\label{sec:orge3d6c76}
Documents has 16 MB limit
For this reason, use \$limit and \$project
100MB RAM per stage limit (can use allowDiskUse: true - last resort!)
 -- allowDiskUsage does not work with GraphLookup
\end{enumerate}

\subsection{Performance of distributed systems}
\label{sec:org5500721}
In sharding - define what is a good shard key by knowing how data is accessed. 

Because a sharded cluster contains MongoS + config servers + shard nodes latency does have an effect. Having the mongos on the same server as the client application an help.

\subsubsection{Reads on Sharded Clusters}
\label{sec:org00b80ad}
Two types of reads in sharded clusters, depending on whether we're using the shard key in our queries or not
\begin{enumerate}
\item Scatter Gather - ask every shard node
\item Router queries - ask a specific node
\end{enumerate}
