mongo.tex

\subsubsection{Sorting in a sharded cluster (same logic for skip or limit)}
\label{sec:org5d3a349}
mongos will send the sort query to each relevant shard, local sorting will be done on each shard, and then a final merge sort happens on the primary shard

\subsection{Increasing write performance with sharding}
\label{sec:orge6d0042}
Each shard contains chunks with a lower and upper bounds based on the shard key. It is important to make sure that data is spread evenly across chunks.

Three things to keep in mind (typically, try to avoid to have the upper and lower bounds be the same value in chunks
\subsubsection{Cardinality}
\label{sec:org10fbaa1}
Number of distinct values for a given shard keys. We want a high cardinality. E.g. country will be very low. To increase cardinality one can use compound keys

\subsubsection{Frequency}
\label{sec:orgf9b8355}
Even distribution of each value across shards. E.g. for surnames in SA "M" would be a LOT more than the rest.

\subsubsection{Rate of change}
\label{sec:org7e3b996}
How our values change over time. Avoid monotonically increasing or decreasing values. E.g. ObjectID is monotonically increasing. - all of the shards will go to the "last" shard close to "maxKey".
Can add e.g. \_id to your shard key if it's the last value in your compound key. This can be a good idea as it increases cardinality as the value will always be unique.

\subsubsection{Bulk Writes}
\label{sec:org961aba7}
Ordered bulk writes - will write in order, waiting for one operation to finish before starting the next one. Unordered will do all in parallel.

In replica sets the writes will all happen on the primary, whereas with a sharded cluster it will happen on the relevant shard, which increases time due to latency.

Unordered - parallel on sharded cluster will be faster. Keep in mind that mongos will need to deserialize each write before sending it to the relevant shard.

\subsection{Reading from Secondaries}
\label{sec:org2907cbc}
Default read preference is "primary".
Can set it to secondary, secondaryPreferred or nearest
Need to know that if you read from secondaries we're not guaranteed to read the most up to data

\subsubsection{When is it a good idea?}
\label{sec:org4fe6809}
Offload work - e.g. analytics / reporting
Local reads in geographical spread replica sets, e.g. if users are split between east and west coast we can read from "nearest" (note they are ok to read stale data)

\subsubsection{When is it a bad idea?}
\label{sec:org68d2390}
In general it is a bad idea
Sharding increases capacity, not replication
Very bad idea to read from secondaries in shards, in fact never read directly from shards

\subsection{Replica sets with differing indexes}
\label{sec:orgd25a2d7}
This should be used with caution, not common practice - specific cases only
These nodes should not be able to become a secondary, because then the indexes will clash

Example:
1 primary, 2 secondary
1 secondary with priority 0
\begin{verbatim}
  var conf = {
      "_id": "M201",
      "members": [
          {_id: 0, "host": "127.0.0.1:27000" },
          {_id: 1, "host": "127.0.0.1:27001" },
          {_id: 2, "host": "127.0.0.1:27002", "priority": 0 }
      ]
  }

// running rs.isMaster() on the primary will result in 2 hosts an 1 passive
//next steps, connect to secondary
db.slaveOk()
\end{verbatim}

To create an index on a specific secondary, start it up as a standalone node (nb use the same dbpath), and then create index, shut it down and start up replica set again



\subsection{Aggregation Pipeline on a sharded cluster}
\label{sec:orga7c6d95}
Because data is distributed in a sharded cluster there is some additional work that needs to be done when performing aggregation.

When doing a match first, the chance is that all data from the match sits on one shard and thus the rest of the aggregation can happen on one shard.
When just doing something like a group, work will be done on each shard, and then merged on one shard (randomly chosen).

Random shard being chosen does not apply for \$out, \$facet, \$lookup, \$graphLookup - primary shard will run the merge

Query optimiser will do some optimising such as moving a match before a sort, or combine two stages into one.



\section{M310}
\label{sec:org145fb84}

\subsection{Auditing (Chapter 3)}
\label{sec:org0388abf}

Audit logs are output in bson or json, with the following format:

\begin{verbatim}
{
    atype: <String>, //action type: authenticate, createIndex, createUser, addChart
    ts: { //timestamp
        "$date": <timestamp> //date and utc time
    },
    local: {
        ip: <String> , port: <int>
    },
    remote: { //incoming event
        ip: <String> , port: <int>
    },
    users: [
        { user: <String>, db: <String> }, ...
    ],
    roles: [
        { role: <String>, db: <String> }, ...
    ],
    param: <document>, //associated with atype
    result: <int> //error code
}


//example of param:
{
    atype: "authenticate",
    ...
        param: {
            user: <user name>,
            db: <database>,
            mechanism: <mechanism>
        }
}
\end{verbatim}

\subsubsection{How to enable}
\label{sec:org16b7043}

Can output to system log, console or file. For file we need more arguments
audit format BSON serialises to disk faster

\begin{verbatim}
mongod --dbpath /data/db --logpath /data/db/mongo.log --fork --auditDestination syslog
mongod --dbpath /data/db --logpath /data/db/mongo.log --fork --auditDestination file --auditFormat JSON --auditPath /data/db/aditLog.bson
\end{verbatim}

\subsubsection{Default logging}
\label{sec:org4e154bd}

\begin{itemize}
\item Schema (DDL)
\item Replica Set and Sharded Cluster
\item Authentication \& Authorization
\end{itemize}

Note: CRUD can be audited, but is not enabled by default because it decreases performance (extra write per operation)

\subsubsection{Audit filter}
\label{sec:orgc102ecc}
Sample config.yaml with added filter
\begin{verbatim}
systemLog:
  destination: file
  path: /data/db/mongo.log
storage:
  dbPath: /data/db
auditLog:
  destination: file
  format: JSON
  path: /data/db/auditLog.json
  filter: '{ atype: { $in: [ "createCollection", "dropCollection" ] } }'
\end{verbatim}

Can either run via the config or the auditFilter parameter
\begin{verbatim}
mongod --config config.yaml --fork
mongod --auditFilter xx
\end{verbatim}

\subsubsection{DDL and DML}
\label{sec:orgbc7f593}
DDL = Data Definition Language (schema change)
\begin{itemize}
\item createCollection
\item createDatabase
\item createIndex
\item renameCollection
\item dropCollection
\item dropDatabase
\item dropIndex
\end{itemize}

\textbf{Create audit filter for DDL}

Filter for getting all createIndex operations for "my application"
\begin{verbatim}
# example namespace: my-application.product
# regex: ^ = starts with, \. = . directly after
  auditLog:
    filter: '{ atype: "createIndex",  "param.ns": /^my-application\./ }'   
\end{verbatim}

DML = Data Manipulation Language (data change)


------------- Chapter 3 - DML operation, still need to do chapt 1 and 2 ----------

\section{M320 Data Modelling}
\label{sec:orgba8361d}
\subsection{Constraints that affect your design}
\label{sec:org8e6d27e}
\subsubsection{Hardware}
\label{sec:org8d9a813}
Storing all data in RAM would be great, but it's expensive. SSD's is the next best thing but can also be expensive
\subsubsection{Data}
\label{sec:org5659989}
The size and security of the data needs to be kept in mind
\subsubsection{Application}
\label{sec:org2e88520}
Network latency
\subsubsection{Databse Server/MongoDB}
\label{sec:org0b91c99}
Documents can't exceed 16MB. For reads, split frequently accessed data from less frequently accessed data. To read you also need to read the entire document into memory
Document writing is acid compliant

\subsection{Working Set}
\label{sec:orgcf7ebbf}
The total body of data that the application uses in the course of normal operations
Frequently accessed data with indexes to be kept in memory if possible (ie keep working set in RAM)

\subsection{The data modelling methodology}
\label{sec:orgca903bc}
