mongo.org
*** Phase 1: Describe the workload,getting everything you need to know about how to use your data
    Logs and stats gives additional information and will be useful
    Create some artifacts from the data you have, e.g. size data, quantify ops, qualify ops
    Record your assumptions

*** Phase 2: Set up relationships
    Start with data from previous phase. Determine relationships
    Identify, quantify, embed or link

*** Phase 3: Apply design patterns or transformations
    Recognise and apply patterns needed for optimisation

  If you track your assumptions as you make changes, it will be easier in the future to relect back to where you were at at the time of the change


** Modelling for simplicity vs performance
   Keeping related data in single collection keeps it simple, data access is just one read to the one collection, all data is together and easy to find.

*** Model for Performance
    Go through all the steps of methodologies and quantify:
    operations per seconds
    latency
    attribution queries: e.g. can application work with data that's a little stale?
    Tends to see more collections when modelling for performance


    Prioritise simplicity over performance

** Relationships
   Entities (objects in mongo) and how they are related to each other

*** Type and cardinality
    - one-to-one
    - one-to-many
    - many-to-many

    In big data, these cardinalities does not always make sense, and modelling it you can, for example, embed children into a parent since typically people don't have more than 2 children, but you can't embed your twitter followers.

    We need to represent "one-to-many" in a better way

**** Modified notations
     Crow foot notation (one-to-zillions - based on one-to-many symbol but has 5 "fingers" instead of 3) and Numeral Notation ([min, likely, max])
     This allows us to represent relationships in a more precise way.

**** One-to-many relationship modelling
     In mongo there are 2 main ways of modelling this relationship:
     - Embed (usually in the entity most queried) - preferred, especially if the embedded document is small
       - in the "one" side
       - in the "many" side
     - Reference (usually referencing in the "many" side) - note that mongo does not support foreign keys or cascade deletes, so if reference relationships change it needs to be manually changed in all places 
       - in the "one" side
       - in the "many" side

**** Many-to-many relationship
     In tabular databases we create a linking table
     In MongoDB:
     - Embed (usually, only the most queried side is considered)
       - array of subdocuments in the "many" side
       - array of subdocuments in the other "many" side
     - Reference
       - array of references in one "many" side
       - array of references in the other "many" side
     
     Example: embed in the main side - results in duplication, indexing is done on the array
     #+BEGIN_SRC javascript
       //carts:
       {
           _id: <objectId>,
           date: <date>,
           items: [
               {qty: xx,
                item: { //copy of item from item collection
                    _id: <int>,
                    title: <string>
                    ...
                }
               }
               ]
        
       }


       //items
       {
           _id: <int>,
           title: <string>
           ...
       }
     #+END_SRC
     
     Example: Using references
     #+BEGIN_SRC javascript
       //items [100K]
       {
           _id: <int>,
           title: <string>,
           sold_at [1,1000]: <string>

       }

       //stores [1000]
       {
           _id: <objectId>,
           storeId: <string> //reference point
           ...
       }
     #+END_SRC
     
    Example: Reference in the secondary side. Need a second query to get more information
    #+BEGIN_SRC javascript
      //items
      {
          _id: <int>,
          ...
      }

      //stores
      {
          ...,
          items_sold[1,10K,100K]: <int> //references _id above
      }

    #+END_SRC

**** One-to-one relationship
     Embed document:
     - fields at same level
     - grouping in sub-documents

     Can split it up and reference the values

     Examples:
     #+BEGIN_SRC javascript
       {
           name: xx,
           line1: xxx,
           country: xxx
       }

       //recommended for one-to-one
       {
           name: xx,
           address: {
               line1: xx,
               country: xx
           }
       }

       //have a store and store_details, have a storeId in both.
     #+END_SRC
     
**** one-to-zillios relationship
     if the "many" is 10000 or more

     How to model? Reference in the many/zillions side. Do not embed!
     #+BEGIN_SRC javascript
       //items [100K]
       {
           _id: <int>,
           ...
       }

       //item_views [100B]
       {
           _id: <string>,
           item_id: <int> //[0,1K, 100M]
       }

     #+END_SRC

** Patterns
   Pattern - e.g. design patterns

   Patterns are to get the best out of your model. Applying patterns may lead to...
   - Duplicating data across documents
   - Accepting staleness in some pieces of data
   - writing extra application side logic to ensure referential integrity (e.g. to remove links between data)

   For a given piece of data..
   - Should or could the information be duplicated or not?
     - Resolve duplication with bulk updates
   - What is the tolerated or acceptable staleness? 
     - Resolve with updates based on change streams
   - Which pieces of data require referential integrity?
     - Resolve or prevent the inconsistencies with change streams or transactions

**** Attribute Pattern
     Polymorphis, can put different products in one collection even if they have different attributes. E.g. Coke, water and a charger in the same collection.
     
     Have some fields that are the same accross all documents, some that has the same name but different values, and then data that are in some documents but not in others.
     
     For optimized queries we'll need indexes, which may lead to many indexes. To make this better, use the attribute pattern.
     
     - Identify the fields you want to transpose (which exists in some documents but not all)
     - Change it to a {key: xx, value: yy} structure 
     - Can also add stuff, e.g. {"k":"capacity", "v":4200, "u": "mAh" } where u indicates the relationship between k and v
     - Can now create an index on subdoc.k and subdoc.v
     
     Fields that share common characterestics
     #+BEGIN_SRC javascript
       //e.g.
       {
           "title": "Dunkirk",
           ...
           "release_USA": "2017/07/23",
           "release_Mexico": "2017/08/01",
           ...       
       }

       //using attribute pattern:
       {
           "title":"Dunkirk",
           ...
           "releases": [
               {
                   "k": "release_USA", "v":"2017/07/23"
               }
           ]
       }

       //Can now do things like:
       db.movies.find({"releases.v":{$gte: "2017/07"}})
     #+END_SRC
     
     Attribute pattern is helpful for these problems:
     - Lots of similar fields
     - Want to search across many fields at once
     - Fields present in only a small subset of documents

     Solution
     - Break field/value into a sub-document with fieldA: field, fieldB: value

     Use case examples:
     - Characteristics of a product
     - Set of fields all having the same value type such as a list of dates

     Benefits and trade-offs
     - Easier to index
     - Allow for non-deterministic field names
     - Ability to qualify the relationship of the original field and value
     
