mongo.tex
\subsubsection{Phase 1: Describe the workload,getting everything you need to know about how to use your data}
\label{sec:orgf305478}
Logs and stats gives additional information and will be useful
Create some artifacts from the data you have, e.g. size data, quantify ops, qualify ops
Record your assumptions

\subsubsection{Phase 2: Set up relationships}
\label{sec:org417ce45}
Start with data from previous phase. Determine relationships
Identify, quantify, embed or link

\subsubsection{Phase 3: Apply design patterns or transformations}
\label{sec:org726f664}
Recognise and apply patterns needed for optimisation

If you track your assumptions as you make changes, it will be easier in the future to relect back to where you were at at the time of the change


\subsection{Modelling for simplicity vs performance}
\label{sec:orgaee798e}
Keeping related data in single collection keeps it simple, data access is just one read to the one collection, all data is together and easy to find.

\subsubsection{Model for Performance}
\label{sec:orgef667a3}
Go through all the steps of methodologies and quantify:
operations per seconds
latency
attribution queries: e.g. can application work with data that's a little stale?
Tends to see more collections when modelling for performance


Prioritise simplicity over performance

\subsection{Relationships}
\label{sec:org4b25034}
Entities (objects in mongo) and how they are related to each other

\subsubsection{Type and cardinality}
\label{sec:orge993382}
\begin{itemize}
\item one-to-one
\item one-to-many
\item many-to-many
\end{itemize}

In big data, these cardinalities does not always make sense, and modelling it you can, for example, embed children into a parent since typically people don't have more than 2 children, but you can't embed your twitter followers.

We need to represent "one-to-many" in a better way

\begin{enumerate}
\item Modified notations
\label{sec:orgb0d576a}
Crow foot notation (one-to-zillions - based on one-to-many symbol but has 5 "fingers" instead of 3) and Numeral Notation ([min, likely, max])
This allows us to represent relationships in a more precise way.

\item One-to-many relationship modelling
\label{sec:org8c63eba}
In mongo there are 2 main ways of modelling this relationship:
\begin{itemize}
\item Embed (usually in the entity most queried) - preferred, especially if the embedded document is small
\begin{itemize}
\item in the "one" side
\item in the "many" side
\end{itemize}
\item Reference (usually referencing in the "many" side) - note that mongo does not support foreign keys or cascade deletes, so if reference relationships change it needs to be manually changed in all places 
\begin{itemize}
\item in the "one" side
\item in the "many" side
\end{itemize}
\end{itemize}

\item Many-to-many relationship
\label{sec:orga4dad08}
In tabular databases we create a linking table
In MongoDB:
\begin{itemize}
\item Embed (usually, only the most queried side is considered)
\begin{itemize}
\item array of subdocuments in the "many" side
\item array of subdocuments in the other "many" side
\end{itemize}
\item Reference
\begin{itemize}
\item array of references in one "many" side
\item array of references in the other "many" side
\end{itemize}
\end{itemize}

Example: embed in the main side - results in duplication, indexing is done on the array
\begin{verbatim}
//carts:
{
    _id: <objectId>,
    date: <date>,
    items: [
        {qty: xx,
         item: { //copy of item from item collection
             _id: <int>,
             title: <string>
             ...
         }
        }
        ]

}


//items
{
    _id: <int>,
    title: <string>
    ...
}
\end{verbatim}

Example: Using references
\begin{verbatim}
//items [100K]
{
    _id: <int>,
    title: <string>,
    sold_at [1,1000]: <string>

}

//stores [1000]
{
    _id: <objectId>,
    storeId: <string> //reference point
    ...
}
\end{verbatim}

Example: Reference in the secondary side. Need a second query to get more information
\begin{verbatim}
//items
{
    _id: <int>,
    ...
}

//stores
{
    ...,
    items_sold[1,10K,100K]: <int> //references _id above
}

\end{verbatim}

\item One-to-one relationship
\label{sec:orgd804167}
Embed document:
\begin{itemize}
\item fields at same level
\item grouping in sub-documents
\end{itemize}

Can split it up and reference the values

Examples:
\begin{verbatim}
{
    name: xx,
    line1: xxx,
    country: xxx
}

//recommended for one-to-one
{
    name: xx,
    address: {
        line1: xx,
        country: xx
    }
}

//have a store and store_details, have a storeId in both.
\end{verbatim}

\item one-to-zillios relationship
\label{sec:orgbedc85d}
if the "many" is 10000 or more

How to model? Reference in the many/zillions side. Do not embed!
\begin{verbatim}
//items [100K]
{
    _id: <int>,
    ...
}

//item_views [100B]
{
    _id: <string>,
    item_id: <int> //[0,1K, 100M]
}

\end{verbatim}
\end{enumerate}

\subsection{Patterns}
\label{sec:org5e7a496}
Pattern - e.g. design patterns

Patterns are to get the best out of your model. Applying patterns may lead to\ldots{}
\begin{itemize}
\item Duplicating data across documents
\item Accepting staleness in some pieces of data
\item writing extra application side logic to ensure referential integrity (e.g. to remove links between data)
\end{itemize}

For a given piece of data..
\begin{itemize}
\item Should or could the information be duplicated or not?
\begin{itemize}
\item Resolve duplication with bulk updates
\end{itemize}
\item What is the tolerated or acceptable staleness? 
\begin{itemize}
\item Resolve with updates based on change streams
\end{itemize}
\item Which pieces of data require referential integrity?
\begin{itemize}
\item Resolve or prevent the inconsistencies with change streams or transactions
\end{itemize}
\end{itemize}

\begin{enumerate}
\item Attribute Pattern
\label{sec:orgad99981}
Polymorphis, can put different products in one collection even if they have different attributes. E.g. Coke, water and a charger in the same collection.

Have some fields that are the same accross all documents, some that has the same name but different values, and then data that are in some documents but not in others.

For optimized queries we'll need indexes, which may lead to many indexes. To make this better, use the attribute pattern.

\begin{itemize}
\item Identify the fields you want to transpose (which exists in some documents but not all)
\item Change it to a \{key: xx, value: yy\} structure
\item Can also add stuff, e.g. \{"k":"capacity", "v":4200, "u": "mAh" \} where u indicates the relationship between k and v
\item Can now create an index on subdoc.k and subdoc.v
\end{itemize}

Fields that share common characterestics
\begin{verbatim}
//e.g.
{
    "title": "Dunkirk",
    ...
    "release_USA": "2017/07/23",
    "release_Mexico": "2017/08/01",
    ...       
}

//using attribute pattern:
{
    "title":"Dunkirk",
    ...
    "releases": [
        {
            "k": "release_USA", "v":"2017/07/23"
        }
    ]
}

//Can now do things like:
db.movies.find({"releases.v":{$gte: "2017/07"}})
\end{verbatim}

Attribute pattern is helpful for these problems:
\begin{itemize}
\item Lots of similar fields
\item Want to search across many fields at once
\item Fields present in only a small subset of documents
\end{itemize}

Solution
\begin{itemize}
\item Break field/value into a sub-document with fieldA: field, fieldB: value
\end{itemize}

Use case examples:
\begin{itemize}
\item Characteristics of a product
\item Set of fields all having the same value type such as a list of dates
\end{itemize}

Benefits and trade-offs
\begin{itemize}
\item Easier to index
\item Allow for non-deterministic field names
\item Ability to qualify the relationship of the original field and value
\end{itemize}
