mongo.org
**** Extended reference pattern
     before lookup: Application side
     3.4+: $lookup, $graphLookup

     Avoid a join by embedding the join table

     e.g.
     #+BEGIN_SRC javascript
       //orders
       {
           order_id: xx,
           customer_id: xx
       }


       //customer
       {
           customer_id: xx,
           street: xx,
           city: xx,
           country: xx
       }
     #+END_SRC
     
     In this case we might be using orders a lot more often than customer (as aggregate root) and thus embedding some basic customer information inside orders may be a good idea.
     Note, we only embed the most frequently queried fields from customer, leaving the rest behind in the customer collection
     #+BEGIN_SRC javascript
       //orders
       {
           order_id: xx,
           customer_id: xx,
           shipping_address: {
               street: xx,
               city: xx,
               country:xx
           }
       }

       //customer looks the same as above

     #+END_SRC

     Yes, we are duplicating data but we speed up the queries.
     How to minimise duplication?
     - For extended reference pattern, choose fields that do not change often
     - Only bring the fields you need, you don't need all the information, can join to find that once in a blue moon

     After a source is updated:
     - What are the extended reference to changed
     - When should the extended references be updated

     Duplication may be better than a unique reference

     E.g. In our example above, it actually works fine if the customer updates their address, because at the time of the order that was their shipping address, so we shouldn't change that.
     Sometimes the updates also don't need to happen immediately accross all collections.
     
     Extended reference pattern summary:
     Problem:
     - Too many repetitive joins
     Solutions:
     - Identify fields on the lookup side
     - Bring those fields into the main object
     Use case examples:
     - Catalog
     - Mobile applications
     - Real-time analytics

     Benefits and Trade-offs
     - Faster reads
     - Reduce number of joins and lookups
     - May introduce lots of dupilcation if extended reference contains fields that mutate a lot

**** Subset Pattern     
     
     Mongo Working set is what is loaded into RAM, which is faster to access etc. What happens if the working set is bigger than RAM?
     - Add RAM
     - Scale horizontally
     - Reduce the size of the working set

     The key is to break up big documents
     
     E.g. movies that has all the details of the movie:
     #+BEGIN_SRC javascript
       //movies
       {
           title: x,
           complete_script: "all the stuff",
           cast: [ //[0,1000]
               {name: xx, role: xx}
           ]
       }

       //Split out e.g. script to movies_extra_info:
       {
           movie_title: xx,
           complete_script: "all the stuff",
       }
     #+END_SRC
     
     Can also extract a subset of the cast to a separate collection, keeping only e.g. 20 of the cast in the array
     #+BEGIN_SRC javascript
       //movies
       {
           title: xx,
           cast: [ //[0,20]
               {name: xx, role: xx}
           ]
       }

       //cast [0,1000]
       {
           name: xx,
           role: xx
       }
     #+END_SRC
     
     Subset Pattern:
     Problem:
     - Working set is too big
     -A lot of pages are evicted from memory
     - A large part of documents is rarely needed

     Solution:
     - Split the collection in 2 collections:
       - most used part of documents
       - less used part of documents
     - Duplicate part of a 1-N or N-N relationship that is often used in the most used sidd

     Use Cases examples
     - List of reviews for a product 
     - List of commnents on an article
     - List of actors in a movie

     Benefits and Trade-Offs:
     - Smaller working set, as often used documents are smaller
     - Shorter disk access fo r bringin in additional documents from the most used collection
     - More round trips to the server
     - A little more space used on disk
       
**** Computed Pattern
     Kind of Computations/Transformations applied to data:
     - Mathematical Operations
       - E.g. sum or aggregations
       - If we're doing the same sum on a collection many times, it may be better to precalculate the sums and store it in a separate collection (i.e. instead of reading the same data a million times and applying the sum, just read it from the "sum" collection)
       - Good example is viewings of movie screenings, since the views will be a lot and writes to screenings will be less. Each time we get a new screening, we add it to the count 
     - Fan out .. (Do many tasks to represent one logical tasks ) [ Screenshot ]
       - on Reads
         - Every read needs to read from several different locations 
       - on Writes
         - Every write translates into writes to several documents
         - By fanning out on writes, the read does not have to fan out anymore as the data is pre-organized at write teim
         - Why use fan out on writes?
           - If the system has plenty of time when the information arrives compared to the acceptable latency of returning data on read operation, then preparing the data at write time makes a lot of sense.
           - Note that if you are doing more writes then reads so the system becomes bound by writes, this may not be a good pattern to apply.
       - A good example for this pattern is the social networking site for sharing photos
         - Copy photos that the user follows onto their profile, so that each time they load their profile it does not have to fetch all the photos from all the users they follow.
    - Roll Up Operations
      - Typically in reporting of financial data
      - Running a group operation
      - Example: We have wine types which contains the type and the country. We may want to look at it by a specific category, such as country. It may make sense to then create collections of this aggregated view
      
    When should we use computed pattern?
    - Overuse resources (CPU)
    - Reduce latency for read operations (If you have long read operations that depend on complex operations)

    Summary:
    Problem:
    - Costly computation or manipulation of data
    - Executed frequently on the same data, producing the same result

    Solution
    - Perform the operation and store the result in the appropriate document and collection
    - If need to redo the operations, keep the source of them

    Use Case Examples
    - IOT
    - Event Sourcing
    - Time Series data
    - Frequent Aggregation Framework queries

    Benefits and Tradeoffs
    - Read queries are faster
    - Saving on resources like CPU and Disk
    - May be difficult to identify the need
    - Avoid applying or overusing it unless needed (may add unwanted complexity)


