mongo.tex

\item Extended reference pattern
\label{sec:org3cc2947}
before lookup: Application side
3.4+: \$lookup, \$graphLookup

Avoid a join by embedding the join table

e.g.
\begin{verbatim}
//orders
{
    order_id: xx,
    customer_id: xx
}


//customer
{
    customer_id: xx,
    street: xx,
    city: xx,
    country: xx
}
\end{verbatim}

In this case we might be using orders a lot more often than customer (as aggregate root) and thus embedding some basic customer information inside orders may be a good idea.
Note, we only embed the most frequently queried fields from customer, leaving the rest behind in the customer collection
\begin{verbatim}
//orders
{
    order_id: xx,
    customer_id: xx,
    shipping_address: {
        street: xx,
        city: xx,
        country:xx
    }
}

//customer looks the same as above

\end{verbatim}

Yes, we are duplicating data but we speed up the queries.
How to minimise duplication?
\begin{itemize}
\item For extended reference pattern, choose fields that do not change often
\item Only bring the fields you need, you don't need all the information, can join to find that once in a blue moon
\end{itemize}

After a source is updated:
\begin{itemize}
\item What are the extended reference to changed
\item When should the extended references be updated
\end{itemize}

Duplication may be better than a unique reference

E.g. In our example above, it actually works fine if the customer updates their address, because at the time of the order that was their shipping address, so we shouldn't change that.
Sometimes the updates also don't need to happen immediately accross all collections.

Extended reference pattern summary:
Problem:
\begin{itemize}
\item Too many repetitive joins
\end{itemize}
Solutions:
\begin{itemize}
\item Identify fields on the lookup side
\item Bring those fields into the main object
\end{itemize}
Use case examples:
\begin{itemize}
\item Catalog
\item Mobile applications
\item Real-time analytics
\end{itemize}

Benefits and Trade-offs
\begin{itemize}
\item Faster reads
\item Reduce number of joins and lookups
\item May introduce lots of dupilcation if extended reference contains fields that mutate a lot
\end{itemize}

\item Subset Pattern
\label{sec:org3fb8bfa}

Mongo Working set is what is loaded into RAM, which is faster to access etc. What happens if the working set is bigger than RAM?
\begin{itemize}
\item Add RAM
\item Scale horizontally
\item Reduce the size of the working set
\end{itemize}

The key is to break up big documents

E.g. movies that has all the details of the movie:
\begin{verbatim}
//movies
{
    title: x,
    complete_script: "all the stuff",
    cast: [ //[0,1000]
        {name: xx, role: xx}
    ]
}

//Split out e.g. script to movies_extra_info:
{
    movie_title: xx,
    complete_script: "all the stuff",
}
\end{verbatim}

Can also extract a subset of the cast to a separate collection, keeping only e.g. 20 of the cast in the array
\begin{verbatim}
//movies
{
    title: xx,
    cast: [ //[0,20]
        {name: xx, role: xx}
    ]
}

//cast [0,1000]
{
    name: xx,
    role: xx
}
\end{verbatim}

Subset Pattern:
Problem:
\begin{itemize}
\item Working set is too big
\end{itemize}
-A lot of pages are evicted from memory
\begin{itemize}
\item A large part of documents is rarely needed
\end{itemize}

Solution:
\begin{itemize}
\item Split the collection in 2 collections:
\begin{itemize}
\item most used part of documents
\item less used part of documents
\end{itemize}
\item Duplicate part of a 1-N or N-N relationship that is often used in the most used sidd
\end{itemize}

Use Cases examples
\begin{itemize}
\item List of reviews for a product
\item List of commnents on an article
\item List of actors in a movie
\end{itemize}

Benefits and Trade-Offs:
\begin{itemize}
\item Smaller working set, as often used documents are smaller
\item Shorter disk access fo r bringin in additional documents from the most used collection
\item More round trips to the server
\item A little more space used on disk
\end{itemize}

\item Computed Pattern
\label{sec:orgd3bca86}
Kind of Computations/Transformations applied to data:
\begin{itemize}
\item Mathematical Operations
\begin{itemize}
\item E.g. sum or aggregations
\item If we're doing the same sum on a collection many times, it may be better to precalculate the sums and store it in a separate collection (i.e. instead of reading the same data a million times and applying the sum, just read it from the "sum" collection)
\item Good example is viewings of movie screenings, since the views will be a lot and writes to screenings will be less. Each time we get a new screening, we add it to the count
\end{itemize}
\item Fan out .. (Do many tasks to represent one logical tasks ) [ Screenshot ]
\begin{itemize}
\item on Reads
\begin{itemize}
\item Every read needs to read from several different locations
\end{itemize}
\item on Writes
\begin{itemize}
\item Every write translates into writes to several documents
\item By fanning out on writes, the read does not have to fan out anymore as the data is pre-organized at write teim
\item Why use fan out on writes?
\begin{itemize}
\item If the system has plenty of time when the information arrives compared to the acceptable latency of returning data on read operation, then preparing the data at write time makes a lot of sense.
\item Note that if you are doing more writes then reads so the system becomes bound by writes, this may not be a good pattern to apply.
\end{itemize}
\end{itemize}
\item A good example for this pattern is the social networking site for sharing photos
\begin{itemize}
\item Copy photos that the user follows onto their profile, so that each time they load their profile it does not have to fetch all the photos from all the users they follow.
\end{itemize}
\end{itemize}
\end{itemize}
\begin{itemize}
\item Roll Up Operations
\begin{itemize}
\item Typically in reporting of financial data
\item Running a group operation
\item Example: We have wine types which contains the type and the country. We may want to look at it by a specific category, such as country. It may make sense to then create collections of this aggregated view
\end{itemize}
\end{itemize}

When should we use computed pattern?
\begin{itemize}
\item Overuse resources (CPU)
\item Reduce latency for read operations (If you have long read operations that depend on complex operations)
\end{itemize}

Summary:
Problem:
\begin{itemize}
\item Costly computation or manipulation of data
\item Executed frequently on the same data, producing the same result
\end{itemize}

Solution
\begin{itemize}
\item Perform the operation and store the result in the appropriate document and collection
\item If need to redo the operations, keep the source of them
\end{itemize}

Use Case Examples
\begin{itemize}
\item IOT
\item Event Sourcing
\item Time Series data
\item Frequent Aggregation Framework queries
\end{itemize}

Benefits and Tradeoffs
\begin{itemize}
\item Read queries are faster
\item Saving on resources like CPU and Disk
\item May be difficult to identify the need
\item Avoid applying or overusing it unless needed (may add unwanted complexity)
\end{itemize}
\end{enumerate}
