mongo.org
*** Bucket Pattern
    It is important to find the middle solution. In the case where you have a 10 mil temperature sensors that sends the data to the db every minute.
    We can't store each of these in it's own document because you will just have way too many documents and it will become unmanageable.
    If we keep 1 document per device it may reach the 16MB quickly, and become unmanageable.
    
    So what do we do?

    Perhaps create one document per device per day. Can also have one array per hour on this document.
    Or one document per device per hour? Then we have smaller documents and can use a sub document with the temperature data instead of an array

    The concept of grouping information together is called bucketing. Bucketing is often done with a date, which makes it easy to delete archive data.

    Gotchas with Buckets:
    - Random insertions or deletions in buckets, if you need to frequently access data in buckets to insert or delete, this may not work
    - Difficult to sort across buckets
    - Ad hoc queries may be more complex, again across buckets
    - Works best when the "complexity" is hidden through the application code

    Summary:

    Problem
    - Avoiding too many documents or too big documents
    - A 1-to-many relationship that can't be embedded

    Solution
    - Define the optimal amount of information to group together
    - Create arrays to store the information in the main object
    - It is basically an embedded 1-to-many relationship, where you get N documents, each having an average of Many/N sub documents

    Use cases examples
    - IoT
    - Data warehouse
    - Lots of information associated to one objects

    Benefits and trade-offs
    - Good balance between number of data acces and size of data returned
    - Makes data more manageable
    - Easy to prune data
    - Can lead to poor query results if not designed properly
    - Less friendly to BI tools as you will need to know the schema to be able to form your queries properly
      
*** Schema Versioning Pattern
    Need to alter the schema a some point
    Have "schema_version" field in each document.

    Application lifecycle for this change:
    - Modify Application
      - Can read/process all versions of documents
        - Have different handler per version
        - Reshape the document before processing it
    - Update all Application servers
      - Install updated application
      - Remove old processes
    - Once migration completed
      - remove the code to process old versions
    
    Document Lifecycle
    - New Documents:
      - application writes them in latest versions
    - Existing documents
      A use updates to documents
      - to transform to latest version
      - Keep forever documents that never need an update
      B ... or transform all
      - documents in batch
        - no worry even if process takes days

    Summary:
    Problem
    - Avoid downtime while doing schema upgrades
    - Upgrading all documents can take hours, days or even weeks when dealing with big data
    - don't want to update all documents

    Solution:
    - Each document gets a "schema_version" field
    - Application can handle all versions
    - Choose your strategy to migrate the documents

    Use case examples
    - Every app that use a database, deployed in production and heavily used
    - System with a lot of legacy data

    Benefits and Trade-Offs:
    - No downtime needed
    - Feel in control of the migration
    - Less future technical Debt
    - May need 2 indexes for same field while in migration period

*** Tree patterns
    For Hierarchical data, with direct relationship between parent and child
    Answers these questions:
    1. Who are the ancestors of Node X?
    2. Who reports to Y?
    3. Find all nodes that are under Z?
    4. Change all categories under N to under P
   
    Model tree structures:
    - Parent References
      Document contains a parent field with reference to its parent
      Good for question 2 and 4
      #+BEGIN_SRC javascript
        {
            name: "office",
            parent: "swag",
        }
        //example query to get all ancestors
        db.categories.aggregate([{
            $graphLookup: {
                from: 'categories',
                startWith: '$name',
                conncetFromField: 'parent',
                connectToField: 'name',
                as: 'ancestors'
            }
        }])

      #+END_SRC
    - Child References
      Array of children
      Good for question 3
      #+BEGIN_SRC javascript
        {
            name: "office",
            children: ["books", "stickers"]
        }
      #+END_SRC
    - Array of ancestors
      Use an ordered array
      Good for question 1,2,3
      #+BEGIN_SRC javascript
        {
            name:  "Books",
            ancestors: ["Swag", "Office"]
        }
      #+END_SRC
    -Materialized Paths (modification of ancestors)
     Use a string value with ancestors with some separator
     Can only use if you need to know the ancestors of X
     Only good for question 1
     #+BEGIN_SRC javascript
       {
           name: "Books",
           ancestors: ".Swag.Office"
       }
     #+END_SRC
     
     Can use a single index with regular expression to find a path
     #+BEGIN_SRC javascript
       //immediate ancestor of Y
       db.categories.find({ancestors: /\.Y$/})

       //if descends from X and Z
       db.categories.find({ancestors: /^\.X.*Y/i})
     #+END_SRC
     
     Summary:
     Problem
     - Representation of hierarchical structured data
     - Different access patterns to navigate the tree
     - Provide optimized model for common operations

     Solution
     - Different patterns
       - Child Reference
       - Parent Reference
       - Array of ancestors
       - Materialized Paths

     Use Cases Exampe
     - Org Charts
     - Product Categories

     Benefits and Trade-Offs
     - Child REference
       - Easy to navigate to children nodes or tree descending access patterns
     - Parent Reference
       - Immediate parent node discovery and tree updates

*** Polymorphic Pattern
    Can group things by either things they have in common or by their differences
    E.g. if we have a customer and food from mexico and a customer and food from canada, we will probably group it by customer.
    
    Useful when you want to create a single view. Last name and surname is the same field but different names, merge into one name.
    
*** Approximation pattern
    



