mongo.tex


\subsubsection{Bucket Pattern}
\label{sec:orgdc96a06}
It is important to find the middle solution. In the case where you have a 10 mil temperature sensors that sends the data to the db every minute.
We can't store each of these in it's own document because you will just have way too many documents and it will become unmanageable.
If we keep 1 document per device it may reach the 16MB quickly, and become unmanageable.

So what do we do?

Perhaps create one document per device per day. Can also have one array per hour on this document.
Or one document per device per hour? Then we have smaller documents and can use a sub document with the temperature data instead of an array

The concept of grouping information together is called bucketing. Bucketing is often done with a date, which makes it easy to delete archive data.

Gotchas with Buckets:
\begin{itemize}
\item Random insertions or deletions in buckets, if you need to frequently access data in buckets to insert or delete, this may not work
\item Difficult to sort across buckets
\item Ad hoc queries may be more complex, again across buckets
\item Works best when the "complexity" is hidden through the application code
\end{itemize}

Summary:

Problem
\begin{itemize}
\item Avoiding too many documents or too big documents
\item A 1-to-many relationship that can't be embedded
\end{itemize}

Solution
\begin{itemize}
\item Define the optimal amount of information to group together
\item Create arrays to store the information in the main object
\item It is basically an embedded 1-to-many relationship, where you get N documents, each having an average of Many/N sub documents
\end{itemize}

Use cases examples
\begin{itemize}
\item IoT
\item Data warehouse
\item Lots of information associated to one objects
\end{itemize}

Benefits and trade-offs
\begin{itemize}
\item Good balance between number of data acces and size of data returned
\item Makes data more manageable
\item Easy to prune data
\item Can lead to poor query results if not designed properly
\item Less friendly to BI tools as you will need to know the schema to be able to form your queries properly
\end{itemize}

\subsubsection{Schema Versioning Pattern}
\label{sec:orgbb62744}
Need to alter the schema a some point
Have "schema\(_{\text{version}}\)" field in each document.

Application lifecycle for this change:
\begin{itemize}
\item Modify Application
\begin{itemize}
\item Can read/process all versions of documents
\begin{itemize}
\item Have different handler per version
\item Reshape the document before processing it
\end{itemize}
\end{itemize}
\item Update all Application servers
\begin{itemize}
\item Install updated application
\item Remove old processes
\end{itemize}
\item Once migration completed
\begin{itemize}
\item remove the code to process old versions
\end{itemize}
\end{itemize}

Document Lifecycle
\begin{itemize}
\item New Documents:
\begin{itemize}
\item application writes them in latest versions
\end{itemize}
\item Existing documents
A use updates to documents
\begin{itemize}
\item to transform to latest version
\item Keep forever documents that never need an update
\end{itemize}
B \ldots{} or transform all
\begin{itemize}
\item documents in batch
\begin{itemize}
\item no worry even if process takes days
\end{itemize}
\end{itemize}
\end{itemize}

Summary:
Problem
\begin{itemize}
\item Avoid downtime while doing schema upgrades
\item Upgrading all documents can take hours, days or even weeks when dealing with big data
\item don't want to update all documents
\end{itemize}

Solution:
\begin{itemize}
\item Each document gets a "schema\(_{\text{version}}\)" field
\item Application can handle all versions
\item Choose your strategy to migrate the documents
\end{itemize}

Use case examples
\begin{itemize}
\item Every app that use a database, deployed in production and heavily used
\item System with a lot of legacy data
\end{itemize}

Benefits and Trade-Offs:
\begin{itemize}
\item No downtime needed
\item Feel in control of the migration
\item Less future technical Debt
\item May need 2 indexes for same field while in migration period
\end{itemize}

\subsubsection{Tree patterns}
\label{sec:orgbfd4218}
For Hierarchical data, with direct relationship between parent and child
Answers these questions:
\begin{enumerate}
\item Who are the ancestors of Node X?
\item Who reports to Y?
\item Find all nodes that are under Z?
\item Change all categories under N to under P
\end{enumerate}

Model tree structures:
\begin{itemize}
\item Parent References
Document contains a parent field with reference to its parent
Good for question 2 and 4
\begin{verbatim}
{
    name: "office",
    parent: "swag",
}
//example query to get all ancestors
db.categories.aggregate([{
    $graphLookup: {
        from: 'categories',
        startWith: '$name',
        conncetFromField: 'parent',
        connectToField: 'name',
        as: 'ancestors'
    }
}])

\end{verbatim}
\item Child References
Array of children
Good for question 3
\begin{verbatim}
{
    name: "office",
    children: ["books", "stickers"]
}
\end{verbatim}
\item Array of ancestors
Use an ordered array
Good for question 1,2,3
\begin{verbatim}
{
    name:  "Books",
    ancestors: ["Swag", "Office"]
}
\end{verbatim}
\end{itemize}
-Materialized Paths (modification of ancestors)
 Use a string value with ancestors with some separator
 Can only use if you need to know the ancestors of X
 Only good for question 1
\begin{verbatim}
{
    name: "Books",
    ancestors: ".Swag.Office"
}
\end{verbatim}

Can use a single index with regular expression to find a path
\begin{verbatim}
//immediate ancestor of Y
db.categories.find({ancestors: /\.Y$/})

//if descends from X and Z
db.categories.find({ancestors: /^\.X.*Y/i})
\end{verbatim}

Summary:
Problem
\begin{itemize}
\item Representation of hierarchical structured data
\item Different access patterns to navigate the tree
\item Provide optimized model for common operations
\end{itemize}

Solution
\begin{itemize}
\item Different patterns
\begin{itemize}
\item Child Reference
\item Parent Reference
\item Array of ancestors
\item Materialized Paths
\end{itemize}
\end{itemize}

Use Cases Exampe
\begin{itemize}
\item Org Charts
\item Product Categories
\end{itemize}

Benefits and Trade-Offs
\begin{itemize}
\item Child REference
\begin{itemize}
\item Easy to navigate to children nodes or tree descending access patterns
\end{itemize}
\item Parent Reference
\begin{itemize}
\item Immediate parent node discovery and tree updates
\end{itemize}
\end{itemize}

\subsubsection{Polymorphic Pattern}
\label{sec:org96ee1ba}
Can group things by either things they have in common or by their differences
E.g. if we have a customer and food from mexico and a customer and food from canada, we will probably group it by customer.

Useful when you want to create a single view. Last name and surname is the same field but different names, merge into one name.

\subsubsection{Approximation pattern}
\label{sec:org8b2c6d7}
\end{document}
